'''
Напишите программу, которая найдёт произведение пар чисел списка.
Парой считаем первый и последний элемент, второй и предпоследний и т.д.
Пример:
- [2, 3, 4, 5, 6] => [12, 15, 16];
- [2, 3, 5, 6] => [12, 15]
'''

lst = [2, 3, 4, 5, 6]


def calculate(lst):
    lst_result = []
    i = 0
    j = -1
    while i < len(lst) / 2:
        lst_result.append(lst[i] * lst[j])
        i += 1
        j -= 1
    print(lst_result)


calculate(lst)
