USER_COMMANDS = ['start', 'help',  'info']

INFO_MESSAGE = '''
Калькулятор работает с рациональными и комплексными числами.
'''
OPERATIONS = '''
Чтобы посмотреть инфо используйте /help
Пожалуйста, введите операцию, которую вы хотите совершить и нажмите Enter:​
'''
MESSAGE_1 = '''
Введите числа и операцию через пробел
'''
MESSAGE_2 = '''
Пример арифметических операций:
+  Сложение
-  Вычитание
/  Деление
*  Умножение
++ Сложение комплексных чисел
-- Вычитание комплексных чисел
// Деление комплексных чисел
** Умножение комплексных чисел
'''
MESSAGE_3 = '''
Например: 6 + 6
или 6.0 + 6.5
через пробел
'''
MESSAGE_4 = '''
Скорей всего телеграм напечатал '—' вместо '--'.
Можно сделать так: поставить 2 минуса и нажать удалить.
'''

