USER_COMMANDS = ['start', 'help',  'info']

INFO_MESSAGE = '''
Телефонный справочник. Он может записывать контакты в базу данных, 
читать ее и выводить на экран, работать с пользователем.
'''
OPERATIONS = '''
Чтобы посмотреть инфо используйте /help
Пожалуйста, введите операцию, которую вы хотите совершить и нажмите Enter:​
'''
MESSAGE_1 = '''
Файл принят
'''
MESSAGE_2 = '''
1. Добавить новую запись
2. Вывод записей на экран
3. Хочешь скопировать базу данных в виде файла себе?
4. Поиск записи
Если хочешь добавить свои контакты в БД, то отправь боту свою телефонную книгу в формате .csv
'''

MESSAGE_3 = '''
1. Имя Фамилия Телефон Описание (через пробел)
'''

MESSAGE_4 = '''
Контакт сохранен
'''

MESSAGE_5 = '''
Вывожу на экран все контакты
'''

MESSAGE_6 = '''
Нипиши имя файла куда ты хочешь сохранить БД
'''

MESSAGE_7 = '''
Копирование прошло успешно
'''
MESSAGE_8 = '''
Нипиши имя файла откуда ты хочешь скопировать БД
'''

MESSAGE_9 = '''
Нипиши Имя или Фамилию или телефон или описание
'''

MESSAGE_10 = '''
searchcontact
'''

MESSAGE_11 = '''
Файл загружен
'''

MESSAGE_12 = '''
Держи
'''