USER_COMMANDS = ['start', 'help',  'info']

INFO_MESSAGE = '''
Инфо о телефонном справочнике
'''
OPERATIONS = '''
Чтобы посмотреть инфо используйте /help
Пожалуйста, введите операцию, которую вы хотите совершить и нажмите Enter:​
'''
MESSAGE_1 = '''
Файл принят
'''
MESSAGE_2 = '''
1. Добавить новую запись
2. Вывод записей на экран
3. Скопировать данные в файл?
4. Сохранить в нашу базу данных?
5. Поиск записи
'''

MESSAGE_3 = '''
1. Имя Фамилия Телефон Описание (через пробел)
'''

MESSAGE_4 = '''
Контакт сохранен
'''

MESSAGE_5 = '''
Вывожу на экран все контакты
'''

MESSAGE_6 = '''
Нипиши имя файла куда ты хочешь сохранить БД
'''

MESSAGE_6 = '''
Копирование прошло успешно
'''
